bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sdio_reg.h
// Copyright 2020-2024 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#pragma once

#include "sdio0_reg.h"
#include "sdio1_reg.h"

//******* MSHC **********//
/* dwc_mshc_map/DWC_mshc_block registers */
#define SDMASA_R(addr)                                *((volatile unsigned int *) (addr + 0x00))
#define BLOCKSIZE_R(addr)                         *((vuint16_t *) (addr + 0x04))
#define SDMA_BUF_BDARY_4K     0 //(0 << 12)
#define SDMA_BUF_BDARY_8K     1 //(1 << 12)
#define SDMA_BUF_BDARY_16K    2 //(2 << 12)
#define SDMA_BUF_BDARY_32K    3 //(3 << 12)
#define SDMA_BUF_BDARY_64K    4 //(4 << 12)
#define SDMA_BUF_BDARY_128K   5 //(5 << 12)
#define SDMA_BUF_BDARY_256K   6 //(6 << 12)
#define SDMA_BUF_BDARY_512K   7 //(7 << 12)

#define BLOCKCOUNT_R(addr)                     *((vuint16_t *)(addr + 0x06))
#define ARGUMENT_R(addr)                       *((volatile unsigned int *)(addr + 0x08))

#define XFER_MODE_R(addr)                          *((vuint16_t *)(addr + 0x0c))
#define XFR_MODE_DMA_EN             BIT(0)
#define XFR_MODE_BLKCNT_EN        BIT(1)
#define XFR_MODE_AUTOCMD12_EN       (0x01 << 2)
#define XFR_MODE_AUTOCMD23_EN       (0x02 << 2)
#define XFR_MODE_AUTOCMD_AUTOSEL    (0x03 << 2)
#define XFR_MODE_DATA_READ        BIT(4)
#define XFR_MODE_MULTBLK_SEL          BIT(5)
#define XFR_MODE_RESP_TYPE        BIT(6)
#define XFR_MODE_RESP_ERRCHK_EN       BIT(7)
#define XFR_MODE_RESP_INT_EN          BIT(8)

#define CMD_R(addr)                                     *((vuint16_t *)(addr + 0x0e))
#define NO_RESP                       (0<<0)
#define RESP_LEN_136                  (1<<0)
#define RESP_LEN_48                   (2<<0)
#define RESP_LEN_48B                    (3<<0)
#define SUB_CMD_FLAG                    BIT(2)
#define CMD_CRC_CHK_ENABLE          BIT(3)
#define CMD_IDX_CHK_ENABLE          BIT(4)
#define DATA_PRESENT_SEL              BIT(5)
#define CMD_TYPE_NORMAL               (0 << 6)
#define CMD_TYPE_SUSPEND              (1 << 6)
#define CMD_TYPE_RESUME               (2 << 6)
#define CMD_TYPE_ABORT                (3 << 6)
#define RESP01_R(addr)                                *((volatile unsigned int *)(addr + 0x10))
#define RESP23_R(addr)                                *((volatile unsigned int *)(addr + 0x14))
#define RESP45_R(addr)                                *((volatile unsigned int *)(addr + 0x18))
#define RESP67_R(addr)                                *((volatile unsigned int *)(addr + 0x1c))
#define BUF_DATA_R(addr)                                *((volatile unsigned int *)(addr + 0x20))
#define PSTATE_REG_R(addr)                            *((volatile unsigned int *)(addr + 0x24))
#define CMD_INHIBIT                 BIT(0)
#define CMD_INHIBIT_DAT             BIT(1)
#define DAT_LINE_ACTIVE             BIT(2)
#define RE_TUNE_REQ                 BIT(3)
#define DAT_7_4_MASK                  (0xF << 4)
#define WR_XFER_ACTIVE              BIT(8)
#define RD_XFER_ACTIVE              BIT(9)
#define BUF_WR_ENABLE                 BIT(10)
#define BUF_RD_ENABLE                 BIT(11)
#define CARD_INSERTED                 BIT(16)
#define CARD_STABLE                 BIT(17)
#define HOST_CTRL1_R(addr)                            *((volatile unsigned char *)(addr + 0x28))
#define LED_CTRL_ON                 (1 << 0)
#define DAT_XFER_WIDTH_4BIT       (1 << 1)
#define HIGH_SPEED_EN                 (1 << 2)
#define DMASEL_MASK                 (0x3 << 3)
#define DMASEL_SDMA               (0 << 3)
#define DMASEL_ADMA2                (2 << 3)
#define DMASEL_ADMA3                (3 << 3)
#define EXTDAT_XFER_WIDTH8        (1 << 5)
#define PWR_CTRL_R(addr)                                *((volatile unsigned char *)(addr + 0x29))
#define SD_BUS_PWR_VDD1             (0x1 << 0)
#define SD_BUS_VOL_VDD1_1P8V        (0x5 << 1)
#define SD_BUS_VOL_VDD1_3P0V        (0x6 << 1)
#define SD_BUS_VOL_VDD1_3P3V        (0x7 << 1)
#define SD_BUS_PWR_VDD2             0x10
#define BGAP_CTRL_R(addr)                               *((volatile unsigned char *)(addr + 0x2a))
#define WUP_CTRL_R(addr)                                *((volatile unsigned char *)(addr + 0x2b))
#define CLK_CTRL_R(addr)                                *((vuint16_t *)(addr + 0x2c))
#define INTERNAL_CLK_EN             BIT(0)
#define INTERNAL_CLK_STABLE       BIT(1)
#define SD_CLK_EN                     BIT(2)
#define PLL_ENABLE                  BIT(3)
#define CLK_GEN_SELECT              BIT(5)
#define UPPER_FREQ_SEL_MASK       0xc0
#define FREQ_SEL_MASK                 0xff00
#define FREQ_SEL_VAL                  (0x7d << 8) /* 0x7a-400khz , 0xfa-200Khz */
#define TOUT_CTRL_R(addr)                               *((volatile unsigned char *)(addr + 0x2e))
#define SW_RST_R(addr)                                *((volatile unsigned char *)(addr + 0x2f))
#define SW_RST_ALL                BIT(0)
#define SW_RST_CMD                BIT(1)
#define SW_RST_DAT                BIT(2)
#define NORMAL_INT_STAT_R(addr)                       *((vuint16_t *)(addr + 0x30))
#define ERROR_INT_STAT_R(addr)                        *((vuint16_t *)(addr + 0x32))
#define NORMAL_INT_STAT_EN_R(addr)                    *((vuint16_t *)(addr + 0x34))
#define ERROR_INT_STAT_EN_R(addr)                     *((vuint16_t *)(addr + 0x36))
#define NORMAL_INT_SIGNAL_EN_R(addr)                  *((vuint16_t *)(addr + 0x38))
#define ERROR_INT_SIGNAL_EN_R(addr)                   *((vuint16_t *)(addr + 0x3a))
#define CMD_COMPLETE_SIGNAL_EN      BIT(0) /* intr when response received */
#define XFER_COMPLETE_SIGNAL_EN     BIT(1) /* intr when data read/write xfer completed */
#define BGAP_EVENT_SIGNAL_EN        BIT(2)
#define DMA_INTERRUPT_SIGNAL_EN     BIT(3)
#define BUF_WR_READY_SIGNAL_EN      BIT(4)
#define BUF_RD_READY_SIGNAL_EN      BIT(5)
#define CARD_INSERTION_SIGNAL_EN    BIT(6)
#define CARD_REMOVAL_SIGNAL_EN      BIT(7)
#define CARD_INTERRUPT_SIGNAL_EN    BIT(8)
#define INT_A_SIGNAL_EN         BIT(9)
#define INT_B_SIGNAL_EN         BIT(10)
#define INT_C_SIGNAL_EN         BIT(11)
#define RE_TUNE_EVENT_SIGNAL_EN       BIT(12)
#define FX_EVENT_SIGNAL_EN        BIT(13)
#define CQE_EVENT_SIGNAL_EN       BIT(14)
#define CMD_TOUT_ERR_SIGNAL_EN        BIT(0) /* bit0 */
#define CMD_CRC_ERR_SIGNAL_EN         BIT(1) /* bit1 */
#define CMD_END_BIT_ERR_SIGNAL_EN     BIT(2)
#define CMD_IDX_ERR_SIGNAL_EN         BIT(3)
#define DATA_TOUT_ERR_SIGNAL_EN       BIT(4)
#define DATA_CRC_ERR_SIGNAL_EN        BIT(5)
#define DATA_END_BIT_ERR_SIGNAL_EN    BIT(6)
#define CUR_LMT_ERR_SIGNAL_EN         BIT(7) /* bit7 */
#define AUTO_CMD_ERR_SIGNAL_EN        BIT(8) /* bit8 */
#define ADMA_ERR_SIGNAL_EN        BIT(9)
#define TUNING_ERR_SIGNAL_EN          BIT(10)
#define RESP_ERR_SIGNAL_EN        BIT(11)
#define BOOT_ACK_ERR_SIGNAL_EN        BIT(12)
#define VENDOR_ERR_SIGNAL_EN1         BIT(13)
#define VENDOR_ERR_SIGNAL_EN2         BIT(14)
#define VENDOR_ERR_SIGNAL_EN3         BIT(15)
#define SD_CMD_INTR_MASK    (CMD_COMPLETE_SIGNAL_EN | CMD_TOUT_ERR_SIGNAL_EN | \
                CMD_CRC_ERR_SIGNAL_EN | CMD_END_BIT_ERR_SIGNAL_EN | \
                CMD_IDX_ERR_SIGNAL_EN)
#define SD_DAT_INTR_MASK    (BUF_RD_READY_SIGNAL_EN | BUF_WR_READY_SIGNAL_EN | \
                XFER_COMPLETE_SIGNAL_EN | DMA_INTERRUPT_SIGNAL_EN | \
                DATA_TOUT_ERR_SIGNAL_EN | DATA_CRC_ERR_SIGNAL_EN | \
                DATA_END_BIT_ERR_SIGNAL_EN | BGAP_EVENT_SIGNAL_EN)
#define SD_BUS_PWR_INTR_MASK    (CUR_LMT_ERR_SIGNAL_EN)
#define SD_CARD_INTR_CHANGE (CARD_INSERTION_SIGNAL_EN | CARD_REMOVAL_SIGNAL_EN)
#define SD_ERROR_MASK       (0xFFFF8000)

