bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sdio_reg.h
#define AUTO_CMD_STAT_R(addr)                         *((vuint16_t *)(addr + 0x3c))
#define HOST_CTRL2_R(addr)                            *((vuint16_t *)(addr + 0x3e))
#define USH_MODE_MASK     0x3
#define UHS_MODE_SDR12    (0)
#define UHS_MODE_SDR25    (1)
#define UHS_MODE_SDR50    (2)
#define UHS_MODE_SDR104   (3)
#define UHS_MODE_DDR50    (4)
#define UHS_MODE_UHS2     (7)
#define SIGNAL_1P8V_EN  (1 << 3)

/* eMMC speed mode */
#define UHS_MODE_EMMC_DS      0
#define UHS_MODE_EMMC_HS      1 /* 25Mhz */
#define UHS_MODE_EMMC_HS200   3 /* 200Mhz */
#define UHS_MODE_EMMC_HSDDR   4 /* DDR50 */
#define USH_MODE_EMMC_HS400   7

#define CAPABILITIES1_R(addr)                         *((volatile unsigned int *)(addr + 0x40))
#define CAPABILITIES2_R(addr)                         *((volatile unsigned int *)(addr + 0x44))
#define CURR_CAPABILITIES1_R(addr)                    *((volatile unsigned int *)(addr + 0x48))
#define CURR_CAPABILITIES2_R(addr)                    *((volatile unsigned int *)(addr + 0x4c))
#define FORCE_AUTO_CMD_STAT_R(addr)                   *((vuint16_t *)(addr + 0x50))
#define FORCE_ERROR_INT_STAT_R(addr)                  *((vuint16_t *)(addr + 0x52))
#define ADMA_ERR_STAT_R(addr)                         *((volatile unsigned int *)(addr + 0x54))
#define ADMA_SA_LOW_R(addr)                           *((volatile unsigned int *)(addr + 0x58))
#define ADMA_SA_HIGH_R(addr)                          *((volatile unsigned int *)(addr + 0x5c))
#define PRESET_INT_R(addr)                            *((volatile unsigned int *)(addr + 0x60))
#define PRESET_DS_R(addr)                             *((vuint16_t *)(addr + 0x62))
#define PRESET_HS_R(addr)                             *((vuint16_t *)(addr + 0x64))
#define PRESET_SD12_R(addr)                           *((vuint16_t *)(addr + 0x66))
#define PRESET_SD25_R(addr)                           *((vuint16_t *)(addr + 0x68))
#define PRESET_SDR50_R(addr)                          *((vuint16_t *)(addr + 0x6a))
#define PRESET_SDR104_R(addr)                         *((vuint16_t *)(addr + 0x6c))
#define PRESET_DDR50_R(addr)                          *((vuint16_t *)(addr + 0x6e))
#define PRESET_UHS2_R(addr)                           *((volatile unsigned int *)(addr + 0x74))
#define ADMA_ID_LOW_R(addr)                           *((volatile unsigned int *)(addr + 0x78))
#define ADMA_ID_HIGH_R(addr)                          *((volatile unsigned int *)(addr + 0x7c))
#define UHS2_BLOCK_SIZE_R(addr)                       *((volatile unsigned long *)(addr + 0x80))
#define UHS2_BLOCK_COUNT_R(addr)                        *((volatile unsigned long *)(addr + 0x84))
#define UHS2_CMD_PKT_0_3_R(addr)                        *((volatile unsigned long *)(addr + 0x88))
#define UHS2_CMD_PKT_4_7_R(addr)                        *((volatile unsigned long *)(addr + 0x8c))
#define UHS2_CMD_PKT_8_11_R(addr)                       *((volatile unsigned long *)(addr + 0x90))
#define UHS2_CMD_PKT_12_15_R(addr)                    *((volatile unsigned long *)(addr + 0x94))
#define UHS2_CMD_PKT_16_19_R(addr)                    *((volatile unsigned long *)(addr+0X98))
#define UHS2_XFER_MODE_R(addr)                        *((volatile unsigned long *)(addr + 0x9c))
#define UHS2_CMD_R(addr)                                  *((volatile unsigned long *)(addr + 0x9e))
#define UHS2_RESP_0_3_R(addr)                             *((volatile unsigned long *)(addr + 0xa0))
#define UHS2_RESP_4_7_R(addr)                             *((volatile unsigned long *)(addr + 0xa4))
#define UHS2_RESP_8_11_R(addr)                        *((volatile unsigned long *)(addr + 0xa8))
#define UHS2_RESP_12_15_R(addr)                       *((volatile unsigned long *)(addr + 0xac))
#define UHS2_RESP_16_19_R(addr)                       *((volatile unsigned long *)(addr + 0xb0))
#define UHS2_MSG_SEL_R(addr)                              *((volatile unsigned long *)(addr + 0xb4))
#define UHS2_MSG_R(addr)                                  *((volatile unsigned long *)(addr + 0xb8))
#define UHS2_DEV_INTR_STATUS_R(addr)                    *((volatile unsigned long *)(addr + 0xbc))
#define UHS2_DEV_SEL_R(addr)                              *((volatile unsigned long *)(addr + 0xbe))
#define UHS2_DEV_INR_CODE_R(addr)                       *((volatile unsigned long *)(addr + 0xbf))
#define UHS2_SOFT_RESET_R(addr)                       *((volatile unsigned long *)(addr + 0xc0))
#define UHS2_TIMER_CNTRL_R(addr)                        *((volatile unsigned long *)(addr + 0xc2))
#define UHS2_ERR_INTR_STATUS_R(addr)                    *((volatile unsigned long *)(addr + 0xc4))
#define UHS2_ERR_INTR_STATUS_EN_R(addr)               *((volatile unsigned long *)(addr + 0xc8))
#define UHS2_ERR_INTR_SIGNAL_EN_R(addr)               *((volatile unsigned long *)(addr + 0xcc))
#define P_UHS2_SETTINGS_R(addr)                         *((volatile unsigned long *)(addr + 0xe0))
#define P_UHS2_HOST_CAPAB(addr)                         *((volatile unsigned long *)(addr + 0xe2))
#define P_UHS2_TEST(addr)                                   *((volatile unsigned long *)(addr + 0xe4))
#define P_EMBEDDED_CNTRL(addr)                          *((volatile unsigned long *)(addr + 0xe6))
#define P_VENDOR_1_SPECIFIC_AREA(addr)                *((volatile unsigned long *)(addr + 0xe8))
#define P_VENDOR_2_SPECIFIC_AREA(addr)                *((volatile unsigned long *)(addr + 0xea))
#define SLOT_INTR_STATUS_R(addr)                          *((volatile unsigned long *)(addr + 0xfc))
#define HOST_CNTRL_VERS_R(addr)                           *((vuint16_t *)(addr + 0xfe))

/* DWC_mshc_map/DWC_mshc_UHS2_setting block register */
#define UHS2_GEN_SET_R(addr)                              *((volatile unsigned long *)(addr + 0x00))
#define UHS2_PHY_SET_R(addr)                              *((volatile unsigned long *)(addr + 0x04))
#define USH2_LNK_TRAN_SET_1_R(addr)                   *((volatile unsigned long *)(addr + 0x08))
#define UHS2_LNK_TRAN_SET_2_R(addr)                   *((volatile unsigned long *)(addr + 0x0c))

/* DWC_mshc_map/DWC_mshc_UHS2_capability register */
#define UHS2_GEN_CAP_R(addr)                              *((volatile unsigned long *)(addr + 0x00))
#define UHS2_PHY_CAP_R(addr)                              *((volatile unsigned long *)(addr + 0x04))
#define UHS2_LNK_TRAN_CAP_1_R(addr)                   *((volatile unsigned long *)(addr + 0x08))
#define UHS2_LNK_TRAN_CAP_2_R(addr)                   *((volatile unsigned long *)(addr + 0x0c))

/* DWC_mshc_map/DWC_mshc_UHS2_test block egister */
#define FORCE_UHS2_ERR_INTR_STATUS_R(addr)            *((volatile unsigned long *)(addr + 0x00))

