bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sdio_reg.h
/* DWC_mshc_map/DWC_mshc_UHS2_ embedded control block egister */
#define EMBEDDED_CTRL_R(addr)                             *((volatile unsigned int *)(addr + 0xf6c))

/* DWC_mshc_map/DWC_mshc_phy_block register */
//#define DWC_MSHC_PTR_PHY_R       0x300
//#define PHY_CNFG_R        (DWC_MSHC_PTR_PHY_R + 0x00)
//#define PHY_CMDPAD_CNFG_R (DWC_MSHC_PTR_PHY_R + 0x04)
//#define PHY_DATAPAD_CNFG_R    (DWC_MSHC_PTR_PHY_R + 0x06)
//#define PHY_CLKPAD_CNFG_R (DWC_MSHC_PTR_PHY_R + 0x08)
//#define PHY_STBPAD_CNFG_R (DWC_MSHC_PTR_PHY_R + 0x0a)
//#define PHY_RSTNPAD_CNFG_R    (DWC_MSHC_PTR_PHY_R + 0x0c)
//#define PHY_PADTEST_CNFG_R    (DWC_MSHC_PTR_PHY_R + 0x0e)
//#define PHY_PADTEST_OUT_R (DWC_MSHC_PTR_PHY_R + 0x10)
//#define PHY_PADTEST_IN_R  (DWC_MSHC_PTR_PHY_R + 0x12)
//#define PHY_PRBS_CNFG_R       (DWC_MSHC_PTR_PHY_R + 0x18)
//#define PHY_PHYLBK_CNFG_R (DWC_MSHC_PTR_PHY_R + 0x1a)
//#define PHY_COMMDL_CNFG_R (DWC_MSHC_PTR_PHY_R + 0x1c)
//#define PHY_SDCLKDL_CNFG_R    (DWC_MSHC_PTR_PHY_R + 0x1d)
//#define PHY_SDCLKDL_DC_R  (DWC_MSHC_PTR_PHY_R + 0x1e)
//#define PHY_SMPLDL_CNFG_R (DWC_MSHC_PTR_PHY_R + 0x20)
//#define PHY_ATDL_CNFG_R       (DWC_MSHC_PTR_PHY_R + 0x21)
//#define PHY_DLL_CTRL_R        (DWC_MSHC_PTR_PHY_R + 0x24)
//#define PHY_DLL_CNFG1_R       (DWC_MSHC_PTR_PHY_R + 0x25)
//#define PHY_DLLDL_CNFG_R  (DWC_MSHC_PTR_PHY_R + 0x28)
//#define PHY_DLL_OFFST_R       (DWC_MSHC_PTR_PHY_R + 0x29)
//#define PHY_DLLMST_TSTDC_R    (DWC_MSHC_PTR_PHY_R + 0x2a)
//#define PHY_DLLBT_CNFG_R  (DWC_MSHC_PTR_PHY_R + 0x2c)
//#define PHY_DLL_STATUS_R  (DWC_MSHC_PTR_PHY_R + 0x2e)
//#define PHY_DLLDBG_MLKDC_R    (DWC_MSHC_PTR_PHY_R + 0x30)
//#define PHY_DLLDBG_SLKDC_R    (DWC_MSHC_PTR_PHY_R + 0x32)

/* DWC_mshc_map/DWC_mshc_UHS2 mhsc vendor1_block register */
//#define MHSC_CTRL_R       0x8
//  #define CMD_CNFLT_CHK_STBIT 0
//#define AT_CTRL_R     0x40
//  #define SW_TUNE_EN_STBIT    4
//#define AT_STAT_R     0x44

/* DWC_mshc_map/DWC_mshc_UHS2 mhsc vendor2_block CQE register */
#define CQVER_R(addr)                                         *((volatile unsigned int *)(addr + 0x180+0x00))
#define CQCAP_R(addr)                                         *((volatile unsigned int *)(addr + 0x180+0x04))
#define CQCFG_R(addr)                                         *((volatile unsigned int *)(addr + 0x180+0x08))
#define CQCTL_R(addr)                                         *((volatile unsigned int *)(addr + 0x180+0x0c))
#define CQIS_R(addr)                                          *((volatile unsigned int *)(addr + 0x180+0x10))
#define CQISE_R(addr)                                         *((volatile unsigned int *)(addr + 0x180+0x14))
#define CQISGE_R(addr)                                    *((volatile unsigned int *)(addr + 0x180+0x18))
#define CQIC_R(addr)                                          *((volatile unsigned int *)(addr + 0x180+0x1c))
#define CQTDLBA_R(addr)                                   *((volatile unsigned int *)(addr + 0x180+0x20))
#define CQTDLBAU_R(addr)                                    *((volatile unsigned int *)(addr + 0x180+0x24))
#define CQTDBR_R(addr)                                    *((volatile unsigned int *)(addr + 0x180+0x28))
#define CQTCN_R(addr)                                         *((volatile unsigned int *)(addr + 0x180+0x2c))
#define CQDQS_R(addr)                                         *((volatile unsigned int *)(addr + 0x180+0x30))
#define CQDPT_R(addr)                                         *((volatile unsigned int *)(addr + 0x180+0x34))
#define CQTCLR_R(addr)                                    *((volatile unsigned int *)(addr + 0x180+0x38))
#define CQSSC1_R(addr)                                    *((volatile unsigned int *)(addr + 0x180+0x40))
#define CQSSC2_R(addr)                                    *((volatile unsigned int *)(addr + 0x180+0x44))
#define CQCRDCT_R(addr)                                   *((volatile unsigned int *)(addr + 0x180+0x48))
#define CQRMEM_R(addr)                                    *((volatile unsigned int *)(addr + 0x180+0x50))
#define CQTERRI_R(addr)                                   *((volatile unsigned int *)(addr + 0x180+0x54))
#define CQCRI_R(addr)                                         *((volatile unsigned int *)(addr + 0x180+0x58))
#define CQCRA_R(addr)                                         *((volatile unsigned int *)(addr + 0x180+0x5c))

/* DWC_mshc_map/DWC_mshc_UHS2 mhsc vendor1_block CQE register *
 * P_VENDOR_1_SPECIFIC_AREA
 */
#define SNPS_MSHC_VER_ID_R(addr)                      *((volatile unsigned int *)(addr + 0x500+0x00))
#define SNPS_MSHC_VER_TYPE_R(addr)                    *((volatile unsigned int *)(addr + 0x500+0x04))
#define SNPS_MSHC_CTRL_R(addr)                            *((volatile unsigned char *)(addr + 0x500+0x08))
#define SNPS_MBIU_CTRL_R(addr)                            *((volatile unsigned char *)(addr + 0x500+0x10))
#define SNPS_EMMC_CTRL_R(addr)                            *((vuint16_t *)(addr + 0x500+0x2c))
#define SNPS_BOOT_CTRL_R(addr)                            *((vuint16_t *)(addr + 0x500+0x2e))
#define SNPS_GP_IN_R(addr)                        *((volatile unsigned int *)(addr + 0x500+0x30))
#define SNPS_GP_OUT_R(addr)                           *((volatile unsigned int *)(addr + 0x500+0x34))
#define SNPS_AT_CTRL_R(addr)                              *((volatile unsigned int *)(addr + 0x500+0x40))
#define AUTO_TUNE_EN          0
#define CI_SEL                1
#define SWIN_TH_EN_BITP     2
#define SWIN_TH_EN_BITW     1
#define RPT_TUNE_ERR          3
#define SW_TUNE_EN          4
#define WIN_EDGE_SEL          8
#define SNPS_AT_STAT_R(addr)                                *((volatile unsigned int *)(addr + 0x500+0x44))

#define OFF             0
#define ON              1
#define DISABLE         0
#define ENABLE          1

#define SDHCI_CLOCK_OFF     1
#define SDHCI_CLOCK_ON      2
#define SDHCI_POWER_OFF     3
#define SDHCI_POWER_ON      4
#define SDHCI_SET_TXPHASE   5
#define SDHCI_SET_RXPHASE   6
#define SDHCI_SW_TUNE_CTRL  7
#define SW_TUNE_DISABLE     0
#define SW_TUNE_ENABLE      1
#define SDHCI_CMDCFLT_CHK      8

