bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sdio_reg.h
#define FREQSEL_CLK_400KHZ  0xff
//#define FREQSEL_SDR12         0x02 /* 25Mhz */
//#define FREQSEL_SDR25         0x01 /* 50Mhz */
//#define FREQSEL_SDR50         0x00 /* 100Mhz */
//#define FREQSEL_SDR104          0x00
//#define FREQSEL_DDR50         0x01

/* MMCM module reset through mshc gpio controls */
#define MMCM_RESET_REG_OFFS 0x534
#define MMCM_RESET_ON   (1 << 0)

//*******  interrupt state EN*********//
#define CMD_COMPLETE_STAT_EN          BIT(0) /* intr when response received */
#define XFER_COMPLETE_STAT_EN         BIT(1) /* intr when data read/write xfer completed */
#define BGAP_EVENT_STAT_EN        BIT(2)
#define DMA_INTERRUPT_STAT_EN         BIT(3)
#define BUF_WR_READY_STAT_EN          BIT(4)
#define BUF_RD_READY_STAT_EN          BIT(5)
#define CARD_INSERTION_STAT_EN            BIT(6)
#define CARD_REMOVAL_STAT_EN          BIT(7)
#define CARD_INTERRUPT_STAT_EN            BIT(8)
#define INT_A_STAT_EN                 BIT(9)
#define INT_B_STAT_EN             BIT(10)
#define INT_C_STAT_EN             BIT(11)
#define RE_TUNE_EVENT_STAT_EN         BIT(12)
#define FX_EVENT_STAT_EN          BIT(13)
#define CQE_EVENT_STAT_EN         BIT(14)
#define ERROR_INTERRUPT_STAT_EN       BIT(15)

#define CMD_TOUT_ERR_STAT_EN          BIT(0) /* bit0 */
#define CMD_CRC_ERR_STAT_EN           BIT(1) /* bit1 */
#define CMD_END_BIT_ERR_STAT_EN           BIT(2) /* bit2 */
#define CMD_IDX_ERR_STAT_EN       BIT(3) /* bit3 */
#define DATA_TOUT_ERR_STAT_EN         BIT(4) /* bit4 */
#define DATA_CRC_ERR_STAT_EN          BIT(5) /* bit5 */
#define DATA_END_BIT_ERR_STAT_EN      BIT(6) /* bit6 */
#define CUR_LMT_ERR_STAT_EN       BIT(7) /* bit7 */
#define AUTO_CMD_ERR_STAT_EN          BIT(8) /* bit8 */
#define ADMA_ERR_STAT_EN              BIT(9) /* bit9 */
#define TUNING_ERR_STAT_EN        BIT(10) /* bit10 */
#define RESP_ERR_STAT_EN          BIT(11) /* bit11 */
#define BOOT_ACK_ERR_STAT_EN          BIT(12) /* bit12 */
#define VENDOR_ERR1_STAT_EN       BIT(13) /* bit13 */
#define VENDOR_ERR2_STAT_EN       BIT(14) /* bit14 */
#define VENDOR_ERR3_STAT_EN       BIT(15) /* bit15 */

//******* clear interrupt *********//
#define CLR_CMD_COMPLETE_STAT         BIT(0) /* intr when response received */
#define CLR_XFER_COMPLETE_STAT        BIT(1) /* intr when data read/write xfer completed */
#define CLR_BGAP_EVENT_STAT       BIT(2)
#define CLR_DMA_INTERRUPT_STAT        BIT(3)
#define CLR_BUF_WR_READY_STAT         BIT(4)
#define CLR_BUF_RD_READY_STAT         BIT(5)
#define CLR_CARD_INSERTION_STAT           BIT(6)
#define CLR_CARD_REMOVAL_STAT         BIT(7)
#define CLR_CARD_INTERRUPT_STAT           BIT(8)
#define CLR_INT_A_STAT            BIT(9)
#define CLR_INT_B_STAT            BIT(10)
#define CLR_INT_C_STAT            BIT(11)
#define CLR_RE_TUNE_EVENT_STAT        BIT(12)
#define CLR_FX_EVENT_STAT         BIT(13)
#define CLR_CQE_EVENT_STAT        BIT(14)

#define CLR_CMD_TOUT_ERR_STAT         BIT(0) /* bit0 */
#define CLR_CMD_CRC_ERR_STAT              BIT(1) /* bit1 */
#define CLR_CMD_END_BIT_ERR_STAT      BIT(2) /* bit2 */
#define CLR_CMD_IDX_ERR_STAT          BIT(3) /* bit3 */
#define CLR_DATA_TOUT_ERR_STAT        BIT(4) /* bit4 */
#define CLR_DATA_CRC_ERR_STAT         BIT(5) /* bit5 */
#define CLR_DATA_END_BIT_ERR_STAT     BIT(6) /* bit6 */
#define CLR_CUR_LMT_ERR_STAT          BIT(7) /* bit7 */
#define CLR_AUTO_CMD_ERR_STAT         BIT(8) /* bit8 */
#define CLR_ADMA_ERR_STAT             BIT(9) /* bit9 */
#define CLR_TUNING_ERR_STAT       BIT(10) /* bit10 */
#define CLR_RESP_ERR_STAT         BIT(11) /* bit11 */
#define CLR_BOOT_ACK_ERR_STAT         BIT(12) /* bit12 */
#define CLR_VENDOR_ERR1_STAT          BIT(13) /* bit13 */
#define CLR_VENDOR_ERR2_STAT          BIT(14) /* bit14 */
#define CLR_VENDOR_ERR3_STAT          BIT(15) /* bit15 */

// eof

